<template>
  <div class="flex flex-col gap-4">
    <span
      class="text-gray-950 border-none uppercase text-balance mt-2 badge bg-white p-4 shadow-md shadow-gray-500"
    >
      วิธีรับมือและปรับตัว Sensitive
    </span>

    <span class="text-gray-300 leading-8">
      <strong>รู้ทันตัวเอง (Self-awareness)</strong><br />
      สังเกตว่าอะไรที่กระตุ้นความรู้สึกอ่อนไหวของคุณ เช่น คำพูดแบบไหน หรือจากใคร
      แล้วลองตั้ง "เกราะใจ" ไว้บ้าง<br /><br />

      <strong>ฝึกเว้นระยะทางอารมณ์ (Emotional distancing)</strong><br />
      ถามตัวเองว่า “สิ่งนี้จริงๆ แล้วมันเกี่ยวกับฉันไหม
      หรือเป็นมุมมองของเขา?”<br />
      การไม่รับทุกอย่างมาใส่ใจทันทีช่วยลดภาระทางอารมณ์ได้เยอะ<br /><br />

      <strong>ตั้งขอบเขต (Set boundaries)</strong><br />
      ถ้าคุณอยู่กับคนที่ชอบพูดแรง หรือชอบทำให้รู้สึกไม่ดี
      บางครั้งการเว้นระยะหรือบอกเขาตรงๆ ก็ช่วยปกป้องความรู้สึกของคุณได้<br /><br />

      <strong>ดูแลตัวเองอย่างจริงจัง (Self-care)</strong><br />
      พักผ่อนให้เพียงพอ ออกกำลังกาย และใช้เวลากับสิ่งที่ทำให้ใจสงบ เช่น ธรรมชาติ
      ดนตรี การเขียน หรือการวาดรูป<br /><br />

      <strong>ฝึกสติ (Mindfulness / สมาธิ)</strong><br />
      การฝึกอยู่กับปัจจุบัน เช่น การนั่งสมาธิสั้นๆ วันละ 5-10 นาที
      ช่วยให้ใจนิ่งขึ้น และไม่ถูกดึงโดยอารมณ์มากเกินไป<br /><br />

      <strong>เขียนความรู้สึกลงกระดาษ (Journaling)</strong><br />
      การเขียนช่วยให้คุณจัดการกับความคิดฟุ้งซ่านและเข้าใจอารมณ์ตัวเองมากขึ้น<br /><br />

      <strong>เข้าใจว่าเราไม่สามารถควบคุมทุกอย่างได้</strong><br />
      ยอมรับว่าเราจะเจอคำพูดหรือเหตุการณ์ที่ไม่ตรงใจ แต่เราควบคุม
      "การตอบสนองของเรา" ได้เสมอ<br />
    </span>
  </div>
  <div className="divider "></div>
</template>
